{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "amethyst_deceiver",
    "1": "black_pied_blewit",
    "10": "destroying_angel",
    "11": "earthstar",
    "12": "enoki_mushroom",
    "13": "fairy_ring_champignon",
    "14": "fly_agaric",
    "15": "giant_puffball",
    "16": "hen_of_the_woods",
    "17": "honey_fungus",
    "18": "horse_mushroom",
    "19": "king_trumpet",
    "2": "black_trumpet",
    "20": "lion's_mane",
    "21": "matsutake",
    "22": "morel",
    "23": "oak_mazegill",
    "24": "oyster_mushroom",
    "25": "panther_cap",
    "26": "parasol_mushroom",
    "27": "pink_ousel",
    "28": "porcelain_fungus",
    "29": "porcini",
    "3": "bleeding_tooth",
    "30": "saffron_milk_cap",
    "31": "scarlet_elfcup",
    "32": "scarlet_waxcap",
    "33": "shaggy_ink_cap",
    "34": "shiitake",
    "35": "shimeji_mushroom",
    "36": "stinkhorn",
    "37": "summer_truffle",
    "38": "truffle",
    "39": "white_truffle",
    "4": "bolete",
    "40": "wood_ear",
    "41": "woolly_milkcap",
    "42": "yellow_foot",
    "43": "yellow_stainer",
    "5": "candy_cap",
    "6": "chanterelle",
    "7": "common_puffball",
    "8": "crimini_mushroom",
    "9": "death_cap"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "amethyst_deceiver": "0",
    "black_pied_blewit": "1",
    "black_trumpet": "2",
    "bleeding_tooth": "3",
    "bolete": "4",
    "candy_cap": "5",
    "chanterelle": "6",
    "common_puffball": "7",
    "crimini_mushroom": "8",
    "death_cap": "9",
    "destroying_angel": "10",
    "earthstar": "11",
    "enoki_mushroom": "12",
    "fairy_ring_champignon": "13",
    "fly_agaric": "14",
    "giant_puffball": "15",
    "hen_of_the_woods": "16",
    "honey_fungus": "17",
    "horse_mushroom": "18",
    "king_trumpet": "19",
    "lion's_mane": "20",
    "matsutake": "21",
    "morel": "22",
    "oak_mazegill": "23",
    "oyster_mushroom": "24",
    "panther_cap": "25",
    "parasol_mushroom": "26",
    "pink_ousel": "27",
    "porcelain_fungus": "28",
    "porcini": "29",
    "saffron_milk_cap": "30",
    "scarlet_elfcup": "31",
    "scarlet_waxcap": "32",
    "shaggy_ink_cap": "33",
    "shiitake": "34",
    "shimeji_mushroom": "35",
    "stinkhorn": "36",
    "summer_truffle": "37",
    "truffle": "38",
    "white_truffle": "39",
    "wood_ear": "40",
    "woolly_milkcap": "41",
    "yellow_foot": "42",
    "yellow_stainer": "43"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.35.2"
}
