{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Аметистовый обманщик (Laccaria amethystina)",
    "1": "Рядовка фиолетовая (Lepista nuda)",
    "2": "Чёрная лисичка (Craterellus cornucopioides)",
    "3": "Кровоточащий зуб (Hydnellum peckii)",
    "4": "Болет (Boletus)",
    "5": "Млечник камфорный (Lactarius camphoratus)",
    "6": "Лисичка (Cantharellus cibarius)",
    "7": "Обыкновенный дождевик (Lycoperdon perlatum)",
    "8": "Шампиньон двуспоровый (Agaricus bisporus)",
    "9": "Бледная поганка (Amanita phalloides)",
    "10": "Мухомор вонючий (Amanita virosa)",
    "11": "Звездовик (Geastrum)",
    "12": "Опёнок зимний (Flammulina velutipes)",
    "13": "Опёнок луговой (Marasmius oreades)",
    "14": "Мухомор красный (Amanita muscaria)",
    "15": "Головач гигантский (Calvatia gigantea)",
    "16": "Грифола курчавая (Grifola frondosa)",
    "17": "Опёнок осенний (Armillaria mellea)",
    "18": "Полевой шампиньон (Agaricus arvensis)",
    "19": "Вёшенка королевская (Pleurotus eryngii)",
    "20": "Ежовик гребенчатый (Hericium erinaceus)",
    "21": "Мацутаке (Tricholoma matsutake)",
    "22": "Сморчок съедобный (Morchella esculenta)",
    "23": "Дубовая губка (Daedalea quercina)",
    "24": "Вёшенка (Pleurotus ostreatus)",
    "25": "Мухомор пантерный (Amanita pantherina)",
    "26": "Гриб-зонтик пёстрый (Macrolepiota procera)",
    "27": "Розовая вёшенка (Pleurotus djamor)",
    "28": "Удемансиелла слизистая (Oudemansiella mucida)",
    "29": "Белый гриб (Boletus edulis)",
    "30": "Рыжик настоящий (Lactarius deliciosus)",
    "31": "Саркосцифа алая (Sarcoscypha coccinea)",
    "32": "Гигроцибе красная (Hygrocybe coccinea)",
    "33": "Навозник белый (Coprinus comatus)",
    "34": "Шиитаке (Lentinula edodes)",
    "35": "Шимедзи (Hypsizygus tessellatus)",
    "36": "Весёлка обыкновенная (Phallus impudicus)",
    "37": "Летний трюфель (Tuber aestivum)",
    "38": "Трюфель (Tuber)",
    "39": "Белый трюфель (Tuber magnatum)",
    "40": "Аурикулярия уховидная (Auricularia auricula-judae)",
    "41": "Волнушка розовая (Lactarius torminosus)",
    "42": "Лисичка желтеющая (Craterellus lutescens)",
    "43": "Шампиньон желтокожий (Agaricus xanthodermus)"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Аметистовый обманщик (Laccaria amethystina)": "0",
    "Рядовка фиолетовая (Lepista nuda)": "1",
    "Чёрная лисичка (Craterellus cornucopioides)": "2",
    "Кровоточащий зуб (Hydnellum peckii)": "3",
    "Болет (Boletus spp.)": "4",
    "Млечник камфорный (Lactarius camphoratus)": "5",
    "Лисичка (Cantharellus cibarius)": "6",
    "Обыкновенный дождевик (Lycoperdon perlatum)": "7",
    "Шампиньон двуспоровый (Agaricus bisporus)": "8",
    "Бледная поганка (Amanita phalloides)": "9",
    "Мухомор вонючий (Amanita virosa)": "10",
    "Звездовик (Geastrum spp.)": "11",
    "Опёнок зимний (Flammulina velutipes)": "12",
    "Опёнок луговой (Marasmius oreades)": "13",
    "Мухомор красный (Amanita muscaria)": "14",
    "Головач гигантский (Calvatia gigantea)": "15",
    "Грифола курчавая (Grifola frondosa)": "16",
    "Опёнок осенний (Armillaria mellea)": "17",
    "Полевой шампиньон (Agaricus arvensis)": "18",
    "Вёшенка королевская (Pleurotus eryngii)": "19",
    "Ежовик гребенчатый (Hericium erinaceus)": "20",
    "Мацутаке (Tricholoma matsutake)": "21",
    "Сморчок съедобный (Morchella esculenta)": "22",
    "Дубовая губка (Daedalea quercina)": "23",
    "Вёшенка (Pleurotus ostreatus)": "24",
    "Мухомор пантерный (Amanita pantherina)": "25",
    "Гриб-зонтик пёстрый (Macrolepiota procera)": "26",
    "Розовая вёшенка (Pleurotus djamor)": "27",
    "Удемансиелла слизистая (Oudemansiella mucida)": "28",
    "Белый гриб (Boletus edulis)": "29",
    "Рыжик настоящий (Lactarius deliciosus)": "30",
    "Саркосцифа алая (Sarcoscypha coccinea)": "31",
    "Гигроцибе красная (Hygrocybe coccinea)": "32",
    "Навозник белый (Coprinus comatus)": "33",
    "Шиитаке (Lentinula edodes)": "34",
    "Шимедзи (Hypsizygus tessellatus)": "35",
    "Весёлка обыкновенная (Phallus impudicus)": "36",
    "Летний трюфель (Tuber aestivum)": "37",
    "Трюфель (Tuber spp.)": "38",
    "Белый трюфель (Tuber magnatum)": "39",
    "Аурикулярия уховидная (Auricularia auricula-judae)": "40",
    "Волнушка розовая (Lactarius torminosus)": "41",
    "Лисичка желтеющая (Craterellus lutescens)": "42",
    "Шампиньон желтокожий (Agaricus xanthodermus)": "43"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.35.2"
}
